Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ $env.BASE_URL || 'http://localhost:3001' }}"
  phases:
    - duration: 60
      arrivalRate: 20
      name: Baseline Load (100 VUs)
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: Stress Ramp-up
scenarios:
  - name: API Baseline Health and Login
    flow:
      - get:
          url: "/api/health"
      - post:
          url: "/api/login"
          json:
            email: "admin@brickbrain.ai"
            password: "password123"
